---
kind: property
id: P:Autodesk.Revit.DB.Opening.SketchId
source: html/91ed6571-13b3-fa4c-d1c3-624e1cbd73f9.htm
---
# Autodesk.Revit.DB.Opening.SketchId Property

Returns id of the Sketch or invalidElementId if element deon't own the Sketch.

## Syntax (C#)
```csharp
public ElementId SketchId { get; }
```